<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%--
	연산자
	1. 산술연산자 (+, -, *, /, %)
		+ : 덧셈만 가능(문자열 결합 X)
			${10 + 10} => 20
			${10 + "10"} => 20
					--> Integer.parseInt("10")
					${10 += "10"} => 1010
			${null + 10} => 10
				null 은 0 취급
			${10 + " 10"} => 오류
		/ : 정수 / 정수 => 실수
			${5/2} => 2.5
			${5 div 2}
		% : 결과는 왼쪽편 부호
			${10 % 3} = 1
			${10 % -3} = 1
			${-10 % 3} = -1
			${-10 % -3} = -1
			
			${10 mod 3} = 1
	2. 비교연산자
		== eq, != ne, < lt, > gt
		<= le, >= ge, 
	3. 논리연산자
	4. empty => empty list
	5. 삼항연산자 condition ? value : value
	
		
 --%>    
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
	<%--
	&#36;{10 + 10} = ${10 + 10 } <br>
	&#36;{10 + "10") = ${10 + "10" } => 공백이 포함되면 안된다<br> 
	&#36;{null + "10"} = ${null + "10" } => null 값은 자동으로 0 으로 대체<br>
	&#36;{5 / 2} = ${5 / 2 } => 정수 / 실수 = 실수 <br>
	&#36;{5 div 2} = ${5 div 2 } => 정수 / 실수 = 실수 <br>
	&#36;{5 % 2} = ${5 % 2 } <br>
	&#36;{5 mod 2} = ${5 mod 2 } <br>
	&#36;{5 += 2} = ${5 += 2 } <br>
	--%>
	<%--
	&#36;{10 == 10} = ${10 == 10 } <br>
	&#36;{10 eq 10} = ${10 eq 10 } <br>
	
	&#36;{10 != 10} = ${10 != 10 } <br>
	&#36;{10 ne 10} = ${10 ne 10 } <br>
	
	&#36;{10 < 10} = ${10 < 10 } <br>
	&#36;{10 lt 10} = ${10 lt 10 } <br>
	
	&#36;{10 > 10} = ${10 > 10 } <br>
	&#36;{10 gt 10} = ${10 gt 10 } <br>
	
	&#36;{10 <= 10} = ${10 <= 10 } <br>
	&#36;{10 le 10} = ${10 le 10 } <br>
	
	&#36;{10 >= 10} = ${10 >= 10 } <br>
	&#36;{10 ge 10} = ${10 ge 10 } <br>
	 --%>
</body>
</html>